In [2]:
import os
import pandas as pd

os.chdir("/home/mediaworker/anaconda2/envs/pandas_playground/")

nba = pd.read_csv("datasets/nba.csv")

In [5]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [13]:
# Syntax 1 - will not work with columns labels with space
# extract single column 'Name' from nba dataframe
# this will return a pandas series
nba.Name.head(5)

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [14]:
# Syntax 2 - will work with columns labels with space
# extract single column 'Team' from nba dataframe
# this will return a pandas series
nba["Name"].head(5)

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [15]:
nba["Number"].head(5)

0     0.0
1    99.0
2    30.0
3    28.0
4     8.0
Name: Number, dtype: float64

In [17]:
try:
    nba["Number11"]
except KeyError:
    print("Oops! no such column found")

Oops! no such column found

In [21]:
# extract more than column
# since extracting more than one column so it
# returns a dataframe
nba[ ["Name", "Position"] ].head(5)

            Name Position
0  Avery Bradley       PG
1    Jae Crowder       SF
2   John Holland       SG
3    R.J. Hunter       SG
4  Jonas Jerebko       PF

In [24]:
# extract more than column
# since extracting more than one column so it
# returns a dataframe. Order of extraction depends 
# the order the inpur ,list contains
nba[ ["Number", "College"] ].head(5)

   Number            College
0     0.0              Texas
1    99.0          Marquette
2    30.0  Boston University
3    28.0      Georgia State
4     8.0                NaN

In [28]:
nba[["Number", "Team"]].head(5)

   Number            Team
0     0.0  Boston Celtics
1    99.0  Boston Celtics
2    30.0  Boston Celtics
3    28.0  Boston Celtics
4     8.0  Boston Celtics

In [30]:
extract_list = ["Salary", "Team", "Name"]
nba[extract_list].head(5)

      Salary            Team           Name
0  7730337.0  Boston Celtics  Avery Bradley
1  6796117.0  Boston Celtics    Jae Crowder
2        NaN  Boston Celtics   John Holland
3  1148640.0  Boston Celtics    R.J. Hunter
4  5000000.0  Boston Celtics  Jonas Jerebko